console.log("Привіт консоль - це JavaScript");
//Клас схожий на структуру у C++
//Управляє користувачами банку.
//Кожен користувач має ПІБ і свій баланс
//Щоб створити об'єкт - треба зробити клас і основі класу зробити об'єкт
//Клас - це механім для створення об'єктів

class BankAccount {
    //В середині класу може бути змінна, доступ до якої має сам клас
    //Це називається ІНКАПУЛЯЦІЯ - приховування даних від зовнішнього світу
    #balance = 0; // Це прихованна змінна
    //акаунтом володіє певна людина owner
    //На акаунті буде баланс
    // Є понаття конструктору.
    //Це функція, яка викликається при стоверні екзепляра клас
    //this - тобто це значить, що цей клас
    // constructor() {
    //     //якщо в класі є якась змінна вона називається поле класу
    //     this.owner = "Михайло Миколайович";
    // }
    constructor(owner = "Михайло Миколайович") {
        this.owner = owner;
    }
    //Для доступу до змінних у середині класу роблять методи,
    // які їх контролюють (захищаються від зовнішнього світу)
    setBalance(balance) {
        if(balance < 0) {
            console.error("Не можна встановити менше 0 баланс");
            return; //виходимо із методу класу
        }
        this.#balance = balance; //користувач може становити баланс
    }
    getBalance() {
        return this.#balance; // повертаємо значення балансу
    }
}

//new BankAccount() - виклик конструктора класу
//ivan - це екземпляр(об'єкт) класу BankAccount
const ivan = new BankAccount();
console.log("owner", ivan.owner);

//Ми для класу робимо правила, по яких він має працювати.
//Баланс - це кошти на рахунку
const oksana = new BankAccount("Оксана Петрівна");
oksana.setBalance(2000);
oksana.setBalance(-2000); // це є проблема. Клас
// oksana.#balance = 0; - так робити не можна
console.log("name", oksana.owner);
console.log("balance", oksana.getBalance());